## Name : Shreekant Sunil Lohagale
## Year & Div : TY-AIML-B
## Roll No. : 32

## testing

In [2]:
print("hello")

hello

# Creating a DataFrame

In [23]:
import pandas as pd

## Inserting data Element in dataframe

In [26]:
data = {
    'Name' : ['ShreeCant', 'NoobEngineer', 'Bob'],
    'Age' : [18, 20, 8],
    'City' : ['Wakad', 'Talegaon','UK']
}

## Printing Elements from Dataframe

In [28]:
pd.DataFrame(data)

           Name  Age      City
0     ShreeCant   18     Wakad
1  NoobEngineer   20  Talegaon
2           Bob    8        UK

# >> Series

In [43]:
df = pd.Series([23,2,4], name='Age')
df

0    23
1     2
2     4
Name: Age, dtype: int64

## Series from list :

In [47]:
# String
country = ['India', 'USA', 'UK']
pd.Series(country)

0    India
1      USA
2       UK
dtype: object

In [49]:
# Interger
run = [28,99,48]
pd.Series(run)

0    28
1    99
2    48
dtype: int64

In [56]:
# Custom index
# Considering Subjects as Index
marks = [21,23,54]
sub = ['Maths', 'English', 'Science']

Marks = pd.Series(marks, index=sub)
Marks

Maths      21
English    23
Science    54
dtype: int64

In [58]:
# Setting the Name for the Series <Marks>
Marks = pd.Series(marks, index=sub, name='Exam-Marks')
Marks

Maths      21
English    23
Science    54
Name: Exam-Marks, dtype: int64

# Series from Dictionary

In [63]:
# Creating Dictionary
marks={
    'maths' : 45,
    'Science' : 65,
    'English' : 98
}

Marks_Series = pd.Series(marks)
Marks

Maths      21
English    23
Science    54
Name: Exam-Marks, dtype: int64